Revit 2024 API
SymbolTypeId.Percent Property
 Symbol %, indicating unit Percentage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Percent { get; }
Visual Basic
Public Shared ReadOnly Property Percent As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Percent {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace